xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
    primask_backup_abort = __get_PRIMASK();
    __disable_irq();

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;
    for (;;);

    /* Just to avoid compiler warnings. */
    (void) primask_backup_abort;
}

void platform_assert(const char *expr, const char *file, int line)
{
    primask_backup_assert = __get_PRIMASK();
    __disable_irq();

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    assert_expr.is_valid = 1;
    assert_expr.expr = expr;
    assert_expr.file = file;
    assert_expr.line = line;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;

    while(1);

    /* Just to avoid compiler warnings. */
    (void) primask_backup_assert;
}

void light_assert(const char *expr, const char *file, int line)
{
    static uint32_t primask_backup_assert = 0;

    primask_backup_assert = __get_PRIMASK();
    __disable_irq();

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    assert_expr.is_valid = 2;
    assert_expr.expr = expr;
    assert_expr.file = file;
    assert_expr.line = line;
    assert_expr.string = assert_string;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;
     while(1);

    /* Just to avoid compiler warnings. */
    (void) primask_backup_assert;
}

void __ram_assert(const char *expr, const char *file, int line)
{
	char exp[] = "RAM_Assert";

    primask_backup_assert = __get_PRIMASK();
    __disable_irq();

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    assert_expr.is_valid = 1;
    assert_expr.expr = exp;
    assert_expr.file = file;
    assert_expr.line = line;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;

    while(1);
    /* Just to avoid compiler warnings. */
    (void) primask_backup_assert;
}

#if defined (__CC_ARM) || defined (__ICCARM__)
void __aeabi_assert(const char *expr, const char *file, int line)
{
    platform_assert(expr, file, line);
}
#endif /* __CC_ARM */

void exception_get_assert_expr(const char **expr, const char **file, int *line)
{
    if (assert_expr.is_valid) {
        *expr = assert_expr.expr;
        *file = assert_expr.file;
        *line = assert_expr.line;
    } else {
        *expr = NULL;
        *file = NULL;
        *line = 0;
    }
}

void exception_print_assert_info(void)
{
    if (assert_expr.is_valid == 1) {
        exception_printf("CM4 assert failed: %s, file: %s, line: %d\r\n",
                         assert_expr.expr,
                         assert_expr.file,
                         (int)assert_expr.line);
    } else if (assert_expr.is_valid == 2) {

    }
}

void exception_dump_config(int flag)
{
    reboot_flag = flag;
}

static int reboot_check(void)
{
    return reboot_flag;
}

/******************************************************************************/
/*            Exception's Dump Mode Functions                        */
/******************************************************************************/
int exception_dump_config_init(void)
{
    return 0;
}

void exception_dump_config_check(void)
{
	uint8_t mode = 0;

	/* check mode */
	if (exception_config_mode.exception_mode == 0) {
		/* error status, exception_dump_mode should not be 0 */
		exception_config_mode.exception_mode_t.reset_after_dump = 1;
		exception_config_mode.exception_mode_t.exception_fulldump_binary = 1;
	}

	mode = (uint8_t)(exception_config_mode.exception_mode & 0xff);
	if ((mode != (uint8_t)((exception_config_mode.exception_mode >>  8) & 0xff)) ||
			(mode != (uint8_t)((exception_config_mode.exception_mode >> 16) & 0xff)) ||
			(mode != (uint8_t)((exception_config_mode.exception_mode >> 24) & 0xff))) {
		/* error status, exception_dump_mode should be a 4 Byets-repeated data*/
		exception_config_mode.exception_mode_t.reset_after_dump = 1;
		exception_config_mode.exception_mode_t.exception_fulldump_binary = 1;
	}
}


/******************************************************************************/
/*            Exception's regitser callbacks Functions                        */
/******************************************************************************/
exception_status_t exception_register_callbacks(exception_config_type *cb)
{
    int i;

    if (exception_config.items >= EXCEPTION_CONFIGURATIONS_MAX) {
        return EXCEPTION_STATUS_ERROR;
    } else {
        /* check if it is already registered */
        for (i = 0; i < exception_config.items; i++) {
            if (exception_config.configs[i].init_cb == cb->init_cb
                    && exception_config.configs[i].dump_cb == cb->dump_cb) {
                return EXCEPTION_STATUS_ERROR;
            }
        }
        exception_config.configs[exception_config.items].init_cb = cb->init_cb;
        exception_config.configs[exception_config.items].dump_cb = cb->dump_cb;
        exception_config.items++;
        return EXCEPTION_STATUS_OK;
    }
}

exception_status_t exception_register_regions(memory_region_type *region)
{
    if (exception_user_regions.items >= EXCEPTION_CONFIGURATIONS_MAX) {
        return EXCEPTION_STATUS_ERROR;
    } else {
        exception_user_regions.regions[exception_user_regions.items].region_name = region->region_name;
        exception_user_regions.regions[exception_user_regions.items].start_address = region->start_address;
        exception_user_regions.regions[exception_user_regions.items].end_address = region->end_address;
        exception_user_regions.regions[exception_user_regions.items].is_dumped = region->is_dumped;
        exception_user_regions.items++;
        return EXCEPTION_STATUS_OK;
    }
}

/******************************************************************************/
/*            Exception's init Functions                                      */
/******************************************************************************/
void exception_init(void)
{
    /*enable unalign access,it will not trap when align access occurs */
    SCB->CCR &= ~SCB_CCR_UNALIGN_TRP_Msk;

    /* enable wdt reset mode for prevent exception flow hang */
    exception_enable_wdt_reset();

    // /* enable exception log service */
    // exception_log_service_init();

    /* show exception mode */
    exception_printf("exception_mode:0x%x\r\n", exception_config_mode.exception_mode);
    /* show pc */
    exception_printf("cm4 pc:0x%x\r\n", exception_context.pc);
    /* show lr */
    exception_printf("cm4 lr:0x%x\r\n", exception_context.lr);

