xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
#if 0
    /* check exception dump configuration if is ok */
    exception_dump_config_check();
#endif

    /* Update Exception Number */
    exception_info.count += 1;

    /* Get current time stamp */
    // hal_gpt_get_free_run_count(HAL_GPT_CLOCK_SOURCE_1M , &(exception_info.timestamp));
    // hal_gpt_get_free_run_count(HAL_GPT_CLOCK_SOURCE_32K , &(exception_info.timestamp_32k));

#if 0
    if (exception_config_mode.exception_mode_t.reset_after_dump == 1) {
        exception_dump_config(DISABLE_WHILELOOP_MAGIC);
    }
#else

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_MINIDUMP) || (EXCEPTION_MEMDUMP_MODE == EXCEPTION_MEMDUMP_NODUMP)
    exception_dump_config(DISABLE_WHILELOOP_MAGIC);
#endif /* EXCEPTION_MEMDUMP_MODE */

#endif
}

/******************************************************************************/
/*            Exception's context dump Functions                              */
/******************************************************************************/
static void exception_dump_context(uint32_t stack[])
{
    /* Context Dump */
    // exception_context.r0   = stack[r0];
    // exception_context.r1   = stack[r1];
    // exception_context.r2   = stack[r2];
    // exception_context.r3   = stack[r3];
    // exception_context.r12  = stack[r12];
    exception_context.sp   = ((uint32_t)stack) + 0x20;
    // exception_context.lr   = stack[lr];
    // exception_context.pc   = stack[pc];
    // exception_context.psr  = stack[psr];

    /* FPU context? */
    if ((exception_context.exc_return & 0x10) == 0) {
        exception_context.control |= 0x4; /* CONTROL.FPCA */
        exception_context.s0 = stack[s0];
        exception_context.s1 = stack[s1];
        exception_context.s2 = stack[s2];
        exception_context.s3 = stack[s3];
        exception_context.s4 = stack[s4];
        exception_context.s5 = stack[s5];
        exception_context.s6 = stack[s6];
        exception_context.s7 = stack[s7];
        exception_context.s8 = stack[s8];
        exception_context.s9 = stack[s9];
        exception_context.s10 = stack[s10];
        exception_context.s11 = stack[s11];
        exception_context.s12 = stack[s12];
        exception_context.s13 = stack[s13];
        exception_context.s14 = stack[s14];
        exception_context.s15 = stack[s15];
        exception_context.fpscr = stack[fpscr];
        exception_context.sp += 72; /* s0-s15, fpsr, reserved */
    }

    /* if CCR.STKALIGN=1, check PSR[9] to know if there is forced stack alignment */
    if ((SCB->CCR & SCB_CCR_STKALIGN_Msk) && (exception_context.psr & 0x200)) {
        exception_context.sp += 4;
    }

    /* update CONTROL.SPSEL and psp if returning to thread mode */
    if (exception_context.exc_return & 0x4) {
        exception_context.control |= 0x2; /* CONTROL.SPSel */
        exception_context.psp = exception_context.sp;
    } else { /* update msp if returning to handler mode */
        exception_context.msp = exception_context.sp;
    }

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT) || (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
    if ((exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_TEXT) || (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_BINARY)) {
        /* feed wdt to keep time for context dump */
        exception_feed_wdt();

        exception_printf("\r\nCM4 Register dump begin:\r\n");
        exception_printf("r0  = 0x%08x\r\n", exception_context.r0);
        exception_printf("r1  = 0x%08x\r\n", exception_context.r1);
        exception_printf("r2  = 0x%08x\r\n", exception_context.r2);
        exception_printf("r3  = 0x%08x\r\n", exception_context.r3);
        exception_printf("r4  = 0x%08x\r\n", exception_context.r4);
        exception_printf("r5  = 0x%08x\r\n", exception_context.r5);
        exception_printf("r6  = 0x%08x\r\n", exception_context.r6);
        exception_printf("r7  = 0x%08x\r\n", exception_context.r7);
        exception_printf("r8  = 0x%08x\r\n", exception_context.r8);
        exception_printf("r9  = 0x%08x\r\n", exception_context.r9);
        exception_printf("r10 = 0x%08x\r\n", exception_context.r10);
        exception_printf("r11 = 0x%08x\r\n", exception_context.r11);
        exception_printf("r12 = 0x%08x\r\n", exception_context.r12);
        exception_printf("lr  = 0x%08x\r\n", exception_context.lr);
        exception_printf("pc  = 0x%08x\r\n", exception_context.pc);
        exception_printf("psr = 0x%08x\r\n", exception_context.psr);
        exception_printf("EXC_RET = 0x%08x\r\n", exception_context.exc_return);

        /* FPU context? */
        if ((exception_context.exc_return & 0x10) == 0) {
            exception_printf("s0  = 0x%08x\r\n", exception_context.s0);
            exception_printf("s1  = 0x%08x\r\n", exception_context.s1);
            exception_printf("s2  = 0x%08x\r\n", exception_context.s2);
            exception_printf("s3  = 0x%08x\r\n", exception_context.s3);
            exception_printf("s4  = 0x%08x\r\n", exception_context.s4);
            exception_printf("s5  = 0x%08x\r\n", exception_context.s5);
            exception_printf("s6  = 0x%08x\r\n", exception_context.s6);
            exception_printf("s7  = 0x%08x\r\n", exception_context.s7);
            exception_printf("s8  = 0x%08x\r\n", exception_context.s8);
            exception_printf("s9  = 0x%08x\r\n", exception_context.s9);
            exception_printf("s10 = 0x%08x\r\n", exception_context.s10);
            exception_printf("s11 = 0x%08x\r\n", exception_context.s11);
            exception_printf("s12 = 0x%08x\r\n", exception_context.s12);
            exception_printf("s13 = 0x%08x\r\n", exception_context.s13);
            exception_printf("s14 = 0x%08x\r\n", exception_context.s14);
            exception_printf("s15 = 0x%08x\r\n", exception_context.s15);
            exception_printf("s16 = 0x%08x\r\n", exception_context.s16);
            exception_printf("s17 = 0x%08x\r\n", exception_context.s17);
            exception_printf("s18 = 0x%08x\r\n", exception_context.s18);
            exception_printf("s19 = 0x%08x\r\n", exception_context.s19);
            exception_printf("s20 = 0x%08x\r\n", exception_context.s20);
            exception_printf("s21 = 0x%08x\r\n", exception_context.s21);
            exception_printf("s22 = 0x%08x\r\n", exception_context.s22);
            exception_printf("s23 = 0x%08x\r\n", exception_context.s23);
            exception_printf("s24 = 0x%08x\r\n", exception_context.s24);
            exception_printf("s25 = 0x%08x\r\n", exception_context.s25);
            exception_printf("s26 = 0x%08x\r\n", exception_context.s26);
            exception_printf("s27 = 0x%08x\r\n", exception_context.s27);
            exception_printf("s28 = 0x%08x\r\n", exception_context.s28);
            exception_printf("s29 = 0x%08x\r\n", exception_context.s29);
            exception_printf("s30 = 0x%08x\r\n", exception_context.s30);
            exception_printf("s31 = 0x%08x\r\n", exception_context.s31);
            exception_printf("fpscr = 0x%08x\r\n", exception_context.fpscr);
        }

        exception_printf("CONTROL = 0x%08x\r\n", exception_context.control);
        exception_printf("MSP     = 0x%08x\r\n", exception_context.msp);
        exception_printf("PSP     = 0x%08x\r\n", exception_context.psp);
        exception_printf("sp      = 0x%08x\r\n", exception_context.sp);
        exception_printf("basepri = 0x%08x\r\n", exception_context.basepri);
        exception_printf("primask = 0x%08x\r\n", exception_context.primask);
        exception_printf("faultmask = 0x%08x\r\n", exception_context.faultmask);
        exception_printf("\r\nCM4 Register dump end:\r\n");
    }
#endif /* EXCEPTION_MEMDUMP_MODE */
}

/******************************************************************************/
/*            Exception's memory dump Functions                               */
/******************************************************************************/
#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT) || (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
static void exception_dump_region_info(const memory_region_type *static_regions, exception_user_regions_t *user_regions)
{
    uint32_t i = 0;
    unsigned int *current, *end;

