xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
    /* static regions */
    for (i = 0; ; i++) {
        if (!static_regions[i].region_name) {
            break;
        }
        if (!static_regions[i].is_dumped) {
            continue;
        }
        current = (unsigned int *)((uint32_t)(static_regions[i].start_address) & 0xfffffffc);
        end     = (unsigned int *)(static_regions[i].end_address);
        if (current < end) {
            /* feed wdt to keep time for output data */
            exception_feed_wdt();
            /* output region's information */
            exception_printf("Region-%s: start_address = 0x%x, end_address = 0x%x\r\n", static_regions[i].region_name, (unsigned int)current, (unsigned int)end);
        }
    }

    /* dynamic regions */
    for (i = 0; ((i < user_regions->items) && (i < EXCEPTION_CONFIGURATIONS_MAX)); i++) {
        if ((user_regions->regions)[i].is_dumped) {
            current = (unsigned int *)((uint32_t)((user_regions->regions)[i].start_address) & 0xfffffffc);
            end     = (unsigned int *)((user_regions->regions)[i].end_address);
            if (current < end) {
                /* feed wdt to keep time for output data */
                exception_feed_wdt();
                /* output region's information */
                exception_printf("Region-%s: start_address = 0x%x, end_address = 0x%x\r\n", (user_regions->regions)[i].region_name, (unsigned int)current, (unsigned int)end);
            }
        }
    }
}
#endif /* EXCEPTION_MEMDUMP_MODE */

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT)
static void exception_dump_region_data_text(const memory_region_type *static_regions, exception_user_regions_t *user_regions)
{
    uint32_t i = 0;
    unsigned int *current, *end;

    /* static regions */
    for (i = 0; ; i++) {
        if (!static_regions[i].region_name) {
            break;
        }
        if (!static_regions[i].is_dumped) {
            continue;
        }
        current = (unsigned int *)((uint32_t)(static_regions[i].start_address) & 0xfffffffc);
        end     = (unsigned int *)(static_regions[i].end_address);
        for (; current < end; current += 4) {
            if (*(current + 0) == 0 &&
                    *(current + 1) == 0 &&
                    *(current + 2) == 0 &&
                    *(current + 3) == 0) {
                continue;
            }
            /* feed wdt to keep time for output data */
            exception_feed_wdt();
            /* output data */
            exception_printf("0x%08x: %08x %08x %08x %08x\r\n",
                             (unsigned int)current,
                             *(current + 0),
                             *(current + 1),
                             *(current + 2),
                             *(current + 3));
        }
    }

    /* dynamic regions */
    for (i = 0; ((i < user_regions->items) && (i < EXCEPTION_CONFIGURATIONS_MAX)); i++) {
        if ((user_regions->regions)[i].is_dumped) {
            current = (unsigned int *)((uint32_t)((user_regions->regions)[i].start_address) & 0xfffffffc);
            end     = (unsigned int *)((user_regions->regions)[i].end_address);
            for (; current < end; current += 4) {
                if (*(current + 0) == 0 &&
                        *(current + 1) == 0 &&
                        *(current + 2) == 0 &&
                        *(current + 3) == 0) {
                    continue;
                }
                /* feed wdt to keep time for output data */
                exception_feed_wdt();
                /* output data */
                exception_printf("0x%08x: %08x %08x %08x %08x\r\n",
                                 (unsigned int)current,
                                 *(current + 0),
                                 *(current + 1),
                                 *(current + 2),
                                 *(current + 3));
            }
        }
    }
}
#endif /* EXCEPTION_MEMDUMP_MODE */

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
static void exception_dump_region_data_binary(const memory_region_type *static_regions, exception_user_regions_t *user_regions)
{
    uint32_t i = 0;
    unsigned int *current, *end;

    /* static regions */
    for (i = 0; ; i++) {
        if (!static_regions[i].region_name) {
            break;
        }
        if (!static_regions[i].is_dumped) {
            continue;
        }
        current = (unsigned int *)((uint32_t)(static_regions[i].start_address) & 0xfffffffc);
        end     = (unsigned int *)(static_regions[i].end_address);
        if (current < end) {
            /* feed wdt to keep time for output data */
            exception_feed_wdt();
            /* output data */
            log_dump_exception_data((const uint8_t *)current, (uint32_t)end - (uint32_t)current);
        }
    }

    /* dynamic regions */
    for (i = 0; ((i < user_regions->items) && (i < EXCEPTION_CONFIGURATIONS_MAX)); i++) {
        if ((user_regions->regions)[i].is_dumped) {
            current = (unsigned int *)((uint32_t)((user_regions->regions)[i].start_address) & 0xfffffffc);
            end     = (unsigned int *)((user_regions->regions)[i].end_address);
            if (current < end) {
                /* feed wdt to keep time for output data */
                exception_feed_wdt();
                /* output data */
                log_dump_exception_data((const uint8_t *)current, (uint32_t)end - (uint32_t)current);
            }
        }
    }
}
#endif /* EXCEPTION_MEMDUMP_MODE */

static void exception_dump_memory(void)
{
    /* Memory Dump */
#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT) || (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
    if ((exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_TEXT) || (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_BINARY)) {

        /* feed wdt to keep time for memory dump */
        exception_feed_wdt();

        /* Print Regions' information */
        exception_printf("CM4 Regions Information:\r\n");
        exception_dump_region_info(memory_regions, &exception_user_regions);


#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT)
        if (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_TEXT)
            /* Print Regions' data */
        {
            exception_dump_region_data_text(memory_regions, &exception_user_regions);
        }
#endif /* EXCEPTION_MEMDUMP_MODE */

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
        if (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_BINARY) {
            /* Print Memory one by one regions */
            exception_printf("CM4 Regions Data:\r\n");
            /* Print Regions' data */
            exception_dump_region_data_binary(memory_regions, &exception_user_regions);
        }
#endif /* EXCEPTION_MEMDUMP_MODE */

        /* dump cm4 end log */
        exception_printf("\r\nmemory dump completed.\r\n");
    }
#endif /* EXCEPTION_MEMDUMP_MODE */

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_MINIDUMP)

    if (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_MINIDUMP) {

