xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
        /* feed wdt to keep time for memory dump */
        exception_feed_wdt();

        /* dump memory data into flash */
        exception_dump_region_data_minidump(memory_regions, &exception_user_regions);
    }
#endif /* EXCEPTION_MEMDUMP_MODE */
}

/******************************************************************************/
/*            Exception's print fault type Functions                          */
/******************************************************************************/
static void printUsageErrorMsg(uint32_t CFSRValue)
{
    exception_printf("Usage fault: ");
    CFSRValue >>= 16; /* right shift to lsb */
    if ((CFSRValue & (1 << 9)) != 0) {
        exception_printf("Divide by zero\r\n");
    }
    if ((CFSRValue & (1 << 8)) != 0) {
        exception_printf("Unaligned access\r\n");
    }
    if ((CFSRValue & (1 << 3)) != 0) {
        exception_printf("Coprocessor error\r\n");
    }
    if ((CFSRValue & (1 << 2)) != 0) {
        exception_printf("Invalid EXC_RETURN\r\n");
    }
    if ((CFSRValue & (1 << 1)) != 0) {
        exception_printf("Invalid state\r\n");
    }
    if ((CFSRValue & (1 << 0)) != 0) {
        exception_printf("Undefined instruction\r\n");
    }
}

static void printMemoryManagementErrorMsg(uint32_t CFSRValue)
{
    exception_printf("Memory Management fault: ");
    CFSRValue &= 0x000000FF; /* mask mem faults */
    if ((CFSRValue & (1 << 5)) != 0) {
        exception_printf("A MemManage fault occurred during FP lazy state preservation\r\n");
    }
    if ((CFSRValue & (1 << 4)) != 0) {
        exception_printf("A derived MemManage fault occurred on exception entry\r\n");
    }
    if ((CFSRValue & (1 << 3)) != 0) {
        exception_printf("A derived MemManage fault occurred on exception return\r\n");
    }
    if ((CFSRValue & (1 << 1)) != 0) { /* Need to check valid bit (bit 7 of CFSR)? */
        exception_printf("Data access violation @0x%08x\r\n", (unsigned int)SCB->MMFAR);
    }
    if ((CFSRValue & (1 << 0)) != 0) {
        exception_printf("MPU or Execute Never (XN) default memory map access violation\r\n");
    }
    if ((CFSRValue & (1 << 7)) != 0) { /* To review: remove this if redundant */
        exception_printf("SCB->MMFAR = 0x%08x\r\n", (unsigned int)SCB->MMFAR);
    }
}

static void printBusFaultErrorMsg(uint32_t CFSRValue)
{
    exception_printf("Bus fault: ");
    CFSRValue &= 0x0000FF00; /* mask bus faults */
    CFSRValue >>= 8;
    if ((CFSRValue & (1 << 5)) != 0) {
        exception_printf("A bus fault occurred during FP lazy state preservation\r\n");
    }
    if ((CFSRValue & (1 << 4)) != 0) {
        exception_printf("A derived bus fault has occurred on exception entry\r\n");
    }
    if ((CFSRValue & (1 << 3)) != 0) {
        exception_printf("A derived bus fault has occurred on exception return\r\n");
    }
    if ((CFSRValue & (1 << 2)) != 0) {
        exception_printf("Imprecise data access error has occurred\r\n");
    }
    if ((CFSRValue & (1 << 1)) != 0) { /* Need to check valid bit (bit 7 of CFSR)? */
        exception_printf("A precise data access error has occurred @x%08x\r\n", (unsigned int)SCB->BFAR);
    }
    if ((CFSRValue & (1 << 0)) != 0) {
        exception_printf("A bus fault on an instruction prefetch has occurred\r\n");
    }
    if ((CFSRValue & (1 << 7)) != 0) { /* To review: remove this if redundant */
        exception_printf("SCB->BFAR = 0x%08x\r\n", (unsigned int)SCB->BFAR);
    }
}
/******************************************************************************/
/*            Exception's dump processor Functions                            */
/******************************************************************************/
void exception_dump_preprocess(uint32_t fault_type)
{
#ifdef HAL_DWT_MODULE_ENABLED
    uint32_t dwt_function3 = DWT->FUNCTION3;
    uint32_t stack_end = DWT->COMP3;
    uint32_t is_match;
#endif
    exception_info.reason = fault_type;
    exception_info.assert_expr = &assert_expr;

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT) || (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
    if ((exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_TEXT) || (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_BINARY)) {

        /* Genie start message */
        exception_printf("<<<<<<<< LOG START LOG START LOG START LOG START LOG START <<<<<<<<\r\n");
    }
#endif
    /* feed wdt to keep time for preprocess */
    exception_feed_wdt();

    exception_printf("\r\nCM4 Fault Dump:\r\n");
    exception_print_assert_info();
    exception_printf("Exception Count = 0x%08x\r\n", (unsigned int)exception_info.count);
    exception_printf("Exception Time = 0x%08x\r\n", (unsigned int)exception_info.timestamp_32k);

    switch (exception_info.reason) {
        case EXCEPTION_NMI:
            exception_printf("\r\nIn NMI Fault Handler\r\n");
            break;
        case EXCEPTION_HARD_FAULT:
            exception_printf("\r\nIn Hard Fault Handler\r\n");
            break;
        case EXCEPTION_MEMMANAGE_FAULT:
            exception_printf("\r\nIn MemManage Fault Handler\r\n");
            break;
        case EXCEPTION_BUS_FAULT:
            exception_printf("\r\nIn Bus Fault Handler\r\n");
            break;
        case EXCEPTION_USAGE_FAULT:
            exception_printf("\r\nIn Usage Fault Handler\r\n");
            break;
        case EXCEPTION_DEBUGMON_FAULT:
            exception_printf("\r\nIn Debug Monitor Fault Handler\r\n");
#ifdef HAL_DWT_MODULE_ENABLED
            /* is task stack overflow? */
            is_match = (dwt_function3 & DWT_FUNCTION_MATCHED_Msk) >> DWT_FUNCTION_MATCHED_Pos;
            exception_printf("Task stack overflow:%c, stack end:0x%x \r\n", ((is_match) ? 'Y' : 'N'), (unsigned int)stack_end);
#endif /* HAL_DWT_MODULE_ENABLED */
            break;
        default:
            exception_printf("\r\nIn Unknow Fault Handler\r\n");
            break;
    }

    exception_printf("SCB->HFSR = 0x%08x\r\n", (unsigned int)SCB->HFSR);
    exception_printf("SCB->CFSR = 0x%08x\r\n", (unsigned int)SCB->CFSR);
    if ((SCB->HFSR & (1 << 30)) != 0) {
        exception_printf("Forced Hard Fault\r\n");
    }
    if ((SCB->CFSR & 0xFFFF0000) != 0) {
        printUsageErrorMsg(SCB->CFSR);
    }
    if ((SCB->CFSR & 0x0000FF00) != 0) {
        printBusFaultErrorMsg(SCB->CFSR);
    }
    if ((SCB->CFSR & 0x000000FF) != 0) {
        printMemoryManagementErrorMsg(SCB->CFSR);
    }
}

void exception_dump_postprocess(void)
{
    uint32_t i = 0;

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT) || (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
    if ((exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_TEXT) || (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_BINARY)) {
        for (i = 0; i < exception_config.items; i++) {
            if (exception_config.configs[i].init_cb) {

